/* -*- Mode: C; tab-width: 4; c-basic-offset: 4; indent-tabs-mode: nil -*- */
/*
 * The MIT License
 *
 * Copyright (c) 2008-2013 YAMAMOTO Naoki
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#define API_INTERNAL
#include "nestalib.h"
#include "bdb.h"

/* B+木を用いたデータベースの関数群です。
 * 関数はスレッドセーフです。
 *
 * キーの長さは 1024 バイト以下に制限されています。
 * 重複キーは許可／不許可に設定できます。
 * 重複キーのデータはリンク形式でデータ部で管理されます。
 * キー順アクセスをサポートしています。
 *
 * キーはバイナリで比較されます。
 * キーの比較を行う関数を外部から設定できます。
 * キー、データともに可変長で扱われます。
 * データ長の最大は31ビット(2GB)まで格納可能です。
 *
 * リーフブロックにキーとデータをパックして格納することも可能です。
 * この場合のデータサイズは 255バイトに制限されています。
 * また、データパックの場合は重複索引は許可させません。
 *
 * エラーが発生した場合はエラーログに出力されます。
 *
 * 参考文献：bit別冊「ファイル構造」(1997)共立出版
 *
 *-------------------------------------------------------------------
 * B+木ノードの索引は右側のリーフに記録される。
 *
 * (root)                       +-+
 *                              |M|
 *                              +-+
 * (node)
 *             +-+-+                        +-+-+-+
 *             |E|I|                        |Q|U|Y|
 *             +-+-+                        +-+-+-+
 *
 * (leaf)
 * +-+-+-+-+ +-+-+-+-+ +-+-+-+-+  +-+-+-+-+ +-+-+-+-+ +-+-+-+-+ +-+-+
 * |A|B|C|D| |E|F|G|H| |I|J|K|L|  |M|N|O|P| |Q|R|S|T| |U|V|W|X| |Y|Z|
 * +-+-+-+-+ +-+-+-+-+ +-+-+-+-+  +-+-+-+-+ +-+-+-+-+ +-+-+-+-+ +-+-+
 *
 *-------------------------------------------------------------------
 * ブランチノード
 * +------+------+--------+----+---+-----+---+---+-----+---+---+
 * |0xBBEE|keynum|nodesize|(10)|ptr|ksize|key|ptr|ksize|key|ptr|...
 * +------+------+--------+----+---+-----+---+---+-----+---+---+
 *
 * リーフ
 * +------+------+--------+----+----+----+---+-----+---+----+-----+---+----+
 * |0xAAEE|keynum|nodesize|next|prev|flag|(9)|ksize|key|dptr|ksize|key|dptr|...
 * +------+------+--------+----+----+----+---+-----+---+----+-----+---+----+
 *
 * 2013/09/08
 * リーフノードのキー値にプレフィックス圧縮をサポートする。
 * 前のキー値と前方一致する値は保持しない方式としてキーサイズとプレフィックスサイズを保持する。
 * キーの復元方法は、pfksize分をデータを前のキーの先頭からコピーすることで復元する。
 * リーフの先頭キーは圧縮対象とはならない(pfksize == 0)。
 * リーフのflagにPREFIX_COMPRESS_NODEのビットが立っている場合は圧縮リーフとして処理する。
 * 新規に作成されるリーフはプロパティ値(NIO_PREFIX_COMPRESS)によって
 * プレフィックス圧縮されたノードとなる。
 *
 * 圧縮リーフ
 * +------+------+--------+----+----+----+---+-----+-------+---+----+
 * |0xAAEE|keynum|nodesize|next|prev|flag|(9)|ksize|pfksize|key|dptr|...
 * +------+------+--------+----+----+----+---+-----+-------+---+----+
 *  nodesize(2): 圧縮後のノードサイズ
 *  ksize(2): 実際のキーサイズ
 *  pfksize(1): プレフィックスサイズ(最大サイズは255)
 *
 *  キー値：00000001,00000002,00000010 の場合の圧縮リーフ
 * |--------------0---------------|------------1----------|------------3-----------|
 * +-------+----+------------+----+-------+----+-----+----+-------+----+------+----+
 * |ksize:8|pf:0|key:00000001|dptr|ksize:8|pf:7|key:2|dptr|ksize:8|pf:6|key:10|dptr|...
 * +-------+----+------------+----+-------+----+-----+----+-------+----+------+----+
 *
 *
 * 2013/10/05
 * リーフノードにアクセスする場合はリーフキャッシュを経由して行う事とした。
 * カーソルを作成してアクセスする場合もリーフキャッシュを経由する。
 * struct leaf_cache_t
 *
 * 2013/11/14
 * キーの削除を行った場合にキーの入れ替えや更新で bdb->node_pgsize を
 * オーバーする可能性があるので挿入時にノードを分割するリミットを
 * (bdb->node_pgsize - 64) とした。
 *
 * 2013/11/15
 * BDB_FILE_VERSION を 10 から 11 に変更した。
 *-------------------------------------------------------------------
 */

/* ヘッダー・ブロック */
#define BDB_HEADER_SIZE             64
#define BDB_FILEID                  "NBTK"
#define BDB_FILE_VERSION            11
